openfoam/tutorials/combustion/coldEngineFoam/freePiston/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/caseSettings"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type    wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $/wall/nut;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $liner;
    }
}

#remove (wall piston)

// ************************************************************************* //
